package com.example.homework14

import com.example.homework14.db.Films

data class MyItem(val filmT: String, val filmVA: String,val filmO: String,val filmP: String?)


val ItemsDB = listOf(

Films("Игры дьявола", "Сидни Люмет", "Драма, Триллер","",""),
Films("На глубине 6 футов", "Скотт Во", "Спорт, Биография, Драма","",""),
Films("Мой брат супергерой", "Антония Нава", "Комедия, Драма, Семейный","",""),
Films("Рыба-мечта", "Антон Бильжо", "Комедия, Мелодрама, Триллер","",""),
Films("Фантазеры", "Федерика Лучизано", "Комедия","",""),
Films("Матрица", "Лилли Вачовска", "фантастика, про боевые исскуства","",""),
Films("Замыкая круг", "Ричард Аттенборо", "мелодрама, Драма","",""),
Films("Развод по-американски", "Пейтон Рид", "Комедия, мелодрама, драма","",""),
Films("Марли и Я", "Девид Френкел", "Комедия, драма, семейный","",""),
Films("На другом конце провода", "Джеймс Додсон", "Комедия, мелодрама, драма","","")
)
